Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K27.tmx
Source language: en_us
Languages: zh_cn

source: The Cage Man
zh_cn: 笼子里的人

source: All day long they kept Horace Nimms in a steel-barred cage.
zh_cn: 他们整天把贺拉斯·尼姆斯关在一个铁栅栏笼子里。

source: For twenty-one years he had perched on a tall stool in that cage, while various persons at various times poked things at him through a hole about big enough to admit an adult guinea pig. Every evening round five-thirty they let Horace out and permitted him to go over to his half of a double-barreled house in Flatbush to sleep.
zh_cn: 二十一年来他一直生活在那个笼子里面的一张高脚凳上，虽然随时都有各种各样的人通过一个天竺鼠可通过大小的小洞戳他每天晚上大概五点半左右的时候他们让贺拉斯出来，允许他去弗拉特布什的双卧房其中一间去睡觉。

source: At eight- thirty the next morning he returned to his cage, hung his two-dollar-and- eighty-nine-cent approximately Panama hat on a peg and changed his blue-serge- suit coat for a still more shiny alpaca.
zh_cn: 第二天早上八点半他回到他的笼子，把他的两美元八十九美分左右的园冠阔边帽挂在一根柱子上，把他的蓝色缝边外套换成更加有光泽的羊驼毛棉混纺织衣。

source: Then he sharpened two pencils to needle-point sharpness, tested his pen by writing "H. Nimms, Esq.," in a small precise hand, gave his adding machine a few preparatory pokes and was ready for the day's work.
zh_cn: 然后他把他的两支铅笔削的像针尖一样锐利，并写下“H. 尼姆斯先生”，通过那小心的精巧的手给他的算数计算机添加一些准备好的拨，为一天的工作做好准备。

source: Horace was proud, in his mild way, of being shut up in the cage with all that money.
zh_cn: 用他自己温和的方式，和这些钱关在这个笼子里贺拉斯感到很骄傲。

source: It carried the suggestion that he was a dangerous man of a possibly predatory nature.
zh_cn: 它似乎传达了一种暗示，即他可能是一个有掠夺性倾向的危险人物。

source: He wasn't.
zh_cn: 然而他并不是。

source: A more patient and docile five feet and two inches of cashier was not to be found between Spuyten Duyvil and Tottenville, Staten Island.
zh_cn: 在斯卜坦杜维尔和斯塔顿岛维尔之间再也找不到一个比他更加耐心，更加温和的五尺两英寸高的收银员了。

source: Cashiers are mostly crabbed.
zh_cn: 收银员大多都是暴躁的。

source: It sours them somehow to hand out all that money and retain so little for their own personal use.
zh_cn: 因为他们要以某种方式拿出所有的钱，只留很少一部分用作己用。

source: But Horace was not of this ilk.
zh_cn: 但是贺拉斯不是这样的。

source: The timidest stenographer did not hesitate to take the pettiest petty-cash slip to his little window and twitter, according to custom: "Forty cents for carbon paper, and let me have it in large bills, please, Uncle Horace."
zh_cn: 胆怯的速记员毫不犹豫的把最小金额的零用现金滑进他的小窗，像惯常那样说道：“贺拉斯叔叔，请给我四十美分的复写纸，让我可以开出巨额的钞票。”

source: He would peer at the slip, pretend it was for forty dollars, smile a friendly smile that made little ripples round his eyes and- according to custom--reply: "Here you be.
zh_cn: 他凝视着滑块，假装那是四十美元，眼里充满小小的涟漪，友好地微笑着并且-像往常一样-回答道：“给你。

source: Now don't be buying yourself a flivver with it."
zh_cn: 现在不要用它去买小汽车哦。”

source: When the office force in a large corporation calls the office cashier "uncle" it is a pretty good indication of the sort of man he is.
zh_cn: 当公司强制在大公司里把办公司收银员叫做“叔叔”，这对他是什么样的人的一个很好象征。

source: For the rest, Horace Nimms was slightly bald, wore convict eye-glasses--the sort you shackle to your head with a chain- kept his cuffs up with lavender sleeve garters, carried a change purse, kept a small red pocket expense book, thought his company the greatest in the world and its president, Oren Hammer, the greatest man, was devoted to a wife and two growing daughters, dreamed of a cottage on Long Island with a few square yards of beets and beans and, finally, earned forty dollars a week.
zh_cn: 至于其他方面，贺拉斯·尼姆斯轻微秃顶，戴着有罪的眼睛-就像用一个铁链锁住你的头一样-袖口上戴着淡紫色套筒袖套，背着奇怪的零钱包，拿着一本小的红色口袋书，认为他的公司是世界上最好的，它的董事长，奥伦·哈默，是最伟大的人，忠诚于他的妻子和两个未成年的女儿，梦想在长岛上有一间小屋并且有个几平方米种满甜菜和大豆的院子，最后，每周可以赚四十美元。

source: Horace Nimms had a figuring mind.
zh_cn: 贺拉斯·尼姆斯有一种计算的头脑。

source: Those ten little Arabic symbols and their combinations and permutations held a fascination for him.
zh_cn: 这十个小的阿拉伯数字和他们的排列组合让他充满魅力。

source: To his ears six times six is thirty-six was as perfect a poem as ever a master bard penned.
zh_cn: 在他耳朵里六乘以六等于三十六就像一首吟游大师写的诗一样完美。

source: When on muggy Flatbush nights he tossed in his brass bed he lulled himself to sleep by dividing 695,481,239 by 433.
zh_cn: 在弗拉特布什闷热的晚上他倒在他的铜床上，通过计算695481239除以433来让自己平静并入睡。

source: At other and more wakeful moments he amused himself by planning an elaborate cost-accounting system for his firm, the Amalgamated Soap Corporation, known to the ends of the earth as the Suds Trust.
zh_cn: 在其他更加让人难以入眠的时刻，他通过给他的公司，联合肥皂公司，在《肥皂的信任》中因天涯海角被人们熟知，设计一个精心制作的成本计算系统来让自己愉快起来。

source: Sometimes he went so far as to play the entertaining game of imaginary conversations.
zh_cn: 有时候他的思想会走得很远去玩虚构对话的休闲游戏。

source: He pictured himself sitting in one of the fat chairs in the office of President Hammer and saying between puffs on one of the presidential perfectos: "Now, looky here, Mr. Hammer.
zh_cn: 他想象自己坐在董事长哈默办公室一张宽大的椅子上，抽着董事长的进口雪茄说到：“现在，请看这里，哈默先生。

source: My plan for a cost-accounting system is-"
zh_cn: 关于成本计算系统我的计划是......”

source: And he limned on his mental canvas that great man, spellbound, enthralled, as he, Horace Nimms, dazzled him with an array of figures, beginning: "Now, let's see, Mr. Hammer.
zh_cn: 他在他的精神画卷上描绘着那个伟人，茫然不知所措，如痴如醉，而他，贺拉斯·尼姆斯，用大量的数据让他眩晕，开始说道：“现在，让我们来看看，哈默先生。

source: Last year the Western works at Purity City, Iowa, made 9,576,491 cakes of Pink Petal Toilet and 6,571,233 cakes of Lily White Laundry at a manufacturing cost of 3.25571 cents a cake, unboxed; now the selling cost a cake was"- and so on.
zh_cn: 去年在纯净城市爱荷华，西方工作者以每个肥皂不计包装3.25571美分的制作成本做了9576491份粉红色花瓣的厕所肥皂以及76812333份百合花白色的洗衣肥皂；现在一块肥皂的销售成本是......”等等。

source: The interview always ended with vigorous hand-shakings on the part of Mr. Hammer and more salary for Mr. Nimms.
zh_cn: 对哈默先生而言是以像通常的采访一样的有力握手结束，而对尼姆斯而言是更加丰厚的薪水。

source: But actually the interview never took place.
zh_cn: 但是事实上并没有这次采访。

source: It wasn't that Horace didn't have confidence in his system.
zh_cn: 这并不是说贺拉斯对他的系统没有信心。

source: He did.
zh_cn: 他是有的。

source: But he didn't have an equal amount in Horace Nimms.
zh_cn: 但是并不代表格拉斯·尼姆斯对他自己有信心。

source: So he worked on in his little cage and enjoyed a fair measure of contentment there, because to him it was a temple of figures, a shrine of subtraction, an altar of addition.
zh_cn: 所以他还是在他自己的小笼子里面工作，享受着公平的满足感，因为对他来说那是一座数字的神庙，减法的圣地，加法的祭台。

source: Figures swarmed in his head as naturally as bees swarm about a locust tree.
zh_cn: 就像蜜蜂聚集在槐树上一样，数字都堆积在他的脑海里。

source: He could tell you off-hand how many cakes of Grade-B soap the Southern Works at Spotless, Louisiana, made in the month of May, 1914.
zh_cn: 他可以立即告诉你1914年五月在路易斯安那州一尘不染的南方工作坊制作的B类肥皂有多少。

source: He simply devoured statistics.
zh_cn: 他可以简单地整合数据。

source: When the door of the cage clanged shut in the morning he felt soothed, at home; he immersed his own small worries in a bath of digits and decimal points.
zh_cn: 早上当笼子的门哐当一声关上的时候他感觉就像在家里一样平静；他沉浸在自己小小的烦恼里，畅游在数字和小数点中。

source: He ate of the lotus leaves of mathematics.
zh_cn: 他吞噬着统计学。

source: He could forget, while juggling with millions of cakes of soap and thousands of dollars, that his rent was due next week; that Polly, his wife, needed a new dress; and that on forty a week one must live largely on beef liver and hope.
zh_cn: 当玩弄着成千上万的肥皂和无数美元的时候，他会忘记他的租金下个月到期；他的妻子波莉想买一件新的裙子；四十美元一周的工资很大程度上来说只能生活在牛肝和希望之中。

source: He sometimes thought, while Subwaying to his office, that if he could only get the ear of Oren Hammer some day and tell him about that cost-accounting system he might get his salary raised to forty-five.
zh_cn: 当地铁穿过他办公室的时候他偶尔会想，如果有一天他可以抓住奥伦·哈默的耳朵，告诉他成本计算系统，那么他的工资也许可以涨到四十五美元。

source: But President Hammer, whose office was on the floor above the cage, was as remote from Horace as the Pleiades.
zh_cn: 但是哈默董事长的办公室在他的笼子的上面，就像昂宿星团一样遥远。

source: To get to see him one had to run a gantlet of superior, inquisitive secretaries.
zh_cn: 为了见到他，必须利用上级的好管闲事的秘书的手腕。

source: Besides Mr. Hammer was reputed to be the busiest man in New York City.
zh_cn: 除此之外哈默先生还是以纽约城最繁忙的人儿著称的。

source: "I wash the faces of forty million people every morning," was the way he put it himself.
zh_cn: “每天早上我为四千万人们洗脸，”这是他自言自语的方式。

source: But the chief reason why Horace Nimms did not approach Mr. Hammer was that Horace held him in genuine awe.
zh_cn: 但是贺拉斯·尼姆斯不能接近哈默先生的主要原因是贺拉斯对他感到十分敬畏。

source: The president was so big, so masterful, so decisive.
zh_cn: 董事长是如此的伟大，如此的专横，如此的果断。

source: His invariable cutaway intimidated Horace; the magnificence of his top hat dazzled the little cashier and benumbed his faculties of speech.
zh_cn: 他一成不变的模样震慑住了贺拉斯；他华丽的大礼帽让这个小小的收银员眼花缭乱，演说能力也麻木了。

source: Once in a while Horace rode down in the same elevator with him and- unobserved- admired his firm profile, the concentration of his brow and the jutting jaw that some one had once said was worth fifty thousand a year in itself, merely as a symbol of determination.
zh_cn: 一次贺拉斯和他搭乘同一部电梯，无意中就十分崇敬他坚毅的侧脸，他眉毛之间的专注以及突出的下巴，曾经有人说那个本身就价值五万美元一年，却仅仅是为了作为决心的象征。

source: Horace would sooner have slapped General Pershing on the back or asked President Wilson to dinner in Flatbush than have addressed Oren Hammer.
zh_cn: 贺拉斯宁可在珀欣将军背后拍一下或者邀请威尔逊董事长在弗拉特布什共进晚餐，也不愿对奥伦·哈默说话。

source: An uncommendable attitude?
zh_cn: 这是一种不值得表扬的态度？

source: Yes.
zh_cn: 是的。

source: But after all those years behind bars, perhaps subconsciously his spirit had become a little caged.
zh_cn: 但是在监狱服刑这么多年之后，也许潜意识里他的灵魂已经变成了一个小的笼子了。

source: One cool September morning Horace entered the cage humming "Annie Rooney."
zh_cn: 一个凉爽的九月清晨贺拉斯哼着“安妮·鲁尼”走进笼子。

source: Coming over in the Subway he had straightened out a little quirk in his cost- accounting system that would save the company one-ninety-fifth of a cent a cake.
zh_cn: 刚才在地铁里他修改了他的成本计算系统中的一个小问题，使得公司每块肥皂可以节省零点九五美分。

source: He took off his worn serge coat, was momentarily concerned at the prospect of having to make it last another season and then with a hitch on his lavender sleeve garters he slipped into his alpaca office coat and added up a few numbers on the adding machine for the sheer joy of it.
zh_cn: 他脱下他的旧锁边外套，立刻想到希望它能够坚持到下一个季节，然后他用淡紫色套筒袖套打了个结，匆忙穿上他的羊驼毛棉混纺织衣，为了纯粹的快乐在算数计算器上加上一些拨。

source: He had not been sitting on his high stool long when he became aware that a man, a stranger, was regarding him fixedly through the steel screen.
zh_cn: 当他意识到有一个陌生男子通过钢板网盯着他的时候，他从他的高脚凳上下来了。

source: The man had calmly placed a chair just outside the cage and was examining the little cashier with the scrutinizing eye of an ornithologist studying a newly discovered species of emu.
zh_cn: 那个男子温和地在笼子外面放了一把椅子，用鸟类学者研究一只新发现种类的鸸鹋一般仔细观察的眼神审视着那个小小的收银员。

source: Horace was a bit disconcerted.
zh_cn: 贺拉斯有一点不安。

source: He knew his accounts were in order and accurate to the last penny.
zh_cn: 他知道他的账目都是符合程序的，精确到最小的一便士。

source: He had nothing to fear on that score.
zh_cn: 在那点上他完全不必担心。

source: Nevertheless, he didn't like the way the man stared at him.
zh_cn: 然而，他不喜欢那个男子盯着他的方式。

source: "If he has something to say to me," thought Horace, "why does he say it with glowers?"
zh_cn: “他是不是有什么想跟我说的，”贺拉斯想，“如果是他为什么要对我怒目而视呢？”

source: He would have asked the starer what the devil he was looking at, but Horace was incapable of incivility.
zh_cn: 他想问那个人他到底在看什么恶魔，但是贺拉斯不会这么没有礼貌。

source: He began nervously to total up a column of figures and was not a little upset to find that under the cold gaze he had made his first mistake in addition since the spring of '98.
zh_cn: 他开始紧张的合计纵栏里面的数据，略带失望的发现在那冰冷的凝视之下他犯了从98年春天以来的第一个错误。

source: He cast a furtive glance or two through the steel netting at the stranger outside, who continued to focus a pair of prominent blue eyes on the self-conscious cashier.
zh_cn: 他偷偷地瞥一眼钢丝网外面的陌生人，他还是用一双显眼的蓝色眼睛盯着这个自觉的收银员。

source: Horace couldn't have explained why those particular eyes rattled him; some mysterious power--black art perhaps.
zh_cn: 贺拉斯完全不能理解为什么这双特别的眼睛会让他慌乱；有一种神秘的力量-也许是黑魔法。

source: The staring man was quite bald, and his head, shaped like a pineapple cheese, had been polished until it seemed almost to glitter in the September sun.
zh_cn: 那个盯着他看的人是秃顶，他的像菠萝奶酪一般的头很光亮，就像九月阳光般的闪光。

source: The eyes, light blue and bulgy, reminded Horace of poached eggs left out in the cold for a week.
zh_cn: 他的眼睛，淡淡的蓝色并有点凸出，这让贺拉斯想到了被冷落了一周的荷包蛋。

source: They had also a certain fishy quality; impassive, yet hungry, like a shark's.
zh_cn: 它们也还有点鱼眼的感觉；冷漠的，饥饿的，就像鲨鱼的眼睛一样。

source: Without being actually fat, the mysterious starer had the appearance of being plump and soft; perhaps it was the way he clasped two small, perfectly manicured hands over a perceptible rotundity at his middle, an unexpected protuberance, as if he were attempting to conceal a honeydew melon under his vest.
zh_cn: 那个神秘的凝视者其实不胖，只有一个丰满柔软的外表；他两只手在中间，在意想不到的突起处握成一个圆球形，好像他试图在他的马甲里面藏一个甜瓜一样。

source: Horace Nimms did his best to concentrate on the little columns of figures he was so fond of drilling and parading, but his glance strayed, almost against his will, to the bald-headed man with the fishy blue eyes, who continued to fasten on Horace the glance a python aims at a rabbit before he bolts him.
zh_cn: 贺拉斯·尼姆斯尽可能的专注于这个他十分喜欢钻研以及畅游的小小专栏里的数据，但是他的眼神还是违背他的意志，游荡在那个秃头的蓝色死鱼眼男人身上，他继续牢牢抓住贺拉斯的一瞥，就像蟒蛇在捕捉兔子之前盯着它一样。

source: At length, after half an hour, Horace could stand it no longer.
zh_cn: 最终，半个小时之后，贺拉斯再也忍受不了了。

source: He addressed the stranger politely.
zh_cn: 他有礼貌的对那个陌生人说。

source: "Is there anything I can do for you?" asked Horace with his avuncular smile.
zh_cn: “我能为您做什么吗？”贺拉斯带着他慈祥的微笑问道。

source: The starer, without once taking his eyes off Horace, rose, advanced to the little window and thrust through it an oversized card.
zh_cn: 罗斯，那个凝视者，仍然没有把他的视线从贺拉斯身上移开，他走向那个小窗并推进去一张非常大的卡片。

source: "You may go on with your work," he said, "just as if you were not under observation.
zh_cn: “你继续你的工作，”他说，“就像你没有被我监视一样。

source: I am here under Mr. Hammer's orders."
zh_cn: 我在这里等哈默先生的命令。”

source: His voice was peculiar- a nasal purr.
zh_cn: 他的声音很特别——带着咕噜咕噜的鼻音。

source: The caged cashier glanced at the card.
zh_cn: 笼子里的收银员看了一眼那张卡片。

source: It read:
zh_cn: 上面写道：

source: S. WALMSLEY COWAN
zh_cn: S. 沃姆斯利·考恩

source: EFFICIENCY EXPERT EXTRAORDINARY
zh_cn: 杰出的效率专家

source: AUTHOR OF "PEP, PERSONALITY, PERSONNEL,"
zh_cn: “人民教育出版社，人事部，人事专员”的作者

source: "HOW TO ENTHUSE EMPLOYEES"
zh_cn: “让员工充满热情”

source: Horace Nimms had a disquieting sensation.
zh_cn: 贺拉斯·尼姆斯有一种不安的感觉。

source: He had heard rumors of a man prowling about in the company, subjecting random employees to strange tests, firing some, moving others to different jobs, but he had always felt that twenty-one years of service and the steel bars of his cage protected him.
zh_cn: 他曾听说一个谣言，一个男人徘徊在公司附近，随机找员工进行奇怪的测验，抨击公司一些不好的，并把人挖到其他的工作中，但是他还是觉得二十一年的服务以及他笼子的铁栏杆在保护着他。

source: And now here was the man, and he, Horace Nimms, was under observation.
zh_cn: 现在那个男子以及他，贺拉斯·尼姆斯，都在相互观察对方。

source: He had always associated the phrase with reports of lunacy cases in the newspapers.
zh_cn: 他甚至还把这个片段联想到了报纸中对精神失常事件的报道。

source: Mr. Cowan returned to his seat near the cage and resumed his silent watch on its inmate.
zh_cn: 考恩先生回到他笼子附近的位子上继续安静地注视着他的犯人。

source: Horace tried to do his work, but he couldn't remember when he had had such a poor day.
zh_cn: 贺拉斯尽力去做他的工作，但是他想不起他什么时候曾有过如此不好的一天。

source: The figures would come wrong and his hand would tremble a little no matter how hard he tried to forget the vigilant Mr. Cowan who sat watching him.
zh_cn: 数据不再引起他的兴趣，无论他多努力忘记正坐在那看着他的警惕的考恩先生，他的手还是在轻微颤抖。

source: At the end of a trying day Horace dismounted from his high stool, hitched up his lavender sleeve garters and inserted himself into his worn blue serge coat.
zh_cn: 在这个努力的一天结束的时候，贺拉斯从他的高脚凳上下来，拉下他的淡紫色套筒袖套，穿上他陈旧的蓝色锁边外套。

source: He would be glad to get back to Flatbush.
zh_cn: 他本应该很高兴的回到弗拉特布什的。

source: Polly would have some fried beef liver and a bread pudding for supper, and they would discuss for the hundredth time just what the ground-floor plan of that cottage would be- if it ever was.
zh_cn: 波莉可能已经准备好了油炸牛肝和面包布丁作为晚餐，他们将会第一百次地商量那个小屋的基本计划-如果曾经有。

source: But Mr. Cowan was waiting for him.
zh_cn: 但是考恩先生在等他。

source: "Step this way, will you--ple-e-ese," said the expert.
zh_cn: “如果您方便，请走这边，”那个专家说着。

source: Horace never remembered when he had heard a word that retained so little of its original meaning as Mr. Cowan's "ple-e-ese."
zh_cn: 贺拉斯想不起他曾什么时候听到过像考恩先生说的那句几乎失去它原本含义的“请”。

source: Clearly it was tossed in as a sop to the hypersensitive.
zh_cn: 很明显他陷入了一种高度的敏感。

source: His "ple-e-ese" could have been translated as "you worm."
zh_cn: 他的“请”可以被理解成“你就是一条虫。”

source: Horace, with a worried brow, followed Mr. Cowan into one of those goldfish- bowl offices affected by large companies with many executives and a limited amount of office space.
zh_cn: 贺拉斯，蹙着眉毛，跟着考恩先生进了其中一间金鱼缸办公室，这办公室是受有很多高管，而办公空间有限的大公司影响的。

source: It contained only a plain table and two stiff chairs.
zh_cn: 那里面只有一张平桌和两把硬的椅子。

source: "Sit down," said Mr. Cowan, "ple-e-ese."
zh_cn: “请坐，”考恩先生说，“请。”

source: It is a difficult linguistic feat to purr and snap at the same time, but Mr. Cowan achieved it.
zh_cn: 同时发出喉音并严厉地说话是一种很难说的语言学技巧，但是考恩先生做到了。
